[
    {
        "id": "intro-01",
        "clase": "PYTH_1000 - C01 - Introducción",
        "es": "Instrucciones\n\nPersonalizar tu historia\n\nEn esta actividad, personalizarás una historia al seleccionar algunas palabras y reemplazarlas con valores proporcionados por el usuario. Tu tarea es usar input() para obtener palabras y crear una versión personalizada de la historia.\n\nEn tu archivo main deberás:\n\nElegir alguna de las dos historias proporcionadas.\n\nSeleccionar dentro de tu historia elegida, cinco palabras para reemplazar (usa [] alrededor de esas palabras).\n\nCrear cinco variables con input() para que el usuario proporcione las palabras que reemplazarán las seleccionadas.\n\nMostrar un título para tu historia con un mensaje en un print().\n\nUsar otro print() para copiar la historia original (ten mucha atención para remover los comentarios #).\n\nReemplaza las palabras seleccionadas utilizando las variables creadas y concaténalas mediante el operador +",
        "en": "Instructions\n\nPersonalize your story\n\nIn this activity, you will personalize a story by selecting some words and replacing them with values provided by the user. Your task is to use input() to get words and create a personalized version of the story.\n\nIn your main file you must:\n\nChoose one of the two provided stories.\n\nSelect five words within your chosen story to replace (use [] around those words).\n\nCreate five variables with input() for the user to provide the words that will replace the selected ones.\n\nDisplay a title for your story with a message in a print().\n\nUse another print() to copy the original story (be careful to remove the comments #).\n\nReplace the selected words using the created variables and concatenate them using the + operator.",
        "pt": "Instruções\n\nPersonalize sua história\n\nNesta atividade, você personalizará uma história selecionando algumas palavras e substituindo-as por valores fornecidos pelo usuário. Sua tarefa é usar input() para obter palavras e criar uma versão personalizada da história.\n\nNo seu arquivo principal, você deve:\n\nEscolher uma das duas histórias fornecidas.\n\nSelecionar cinco palavras dentro da sua história escolhida para substituir (use [] ao redor dessas palavras).\n\nCriar cinco variáveis com input() para que o usuário forneça as palavras que substituirão as selecionadas.\n\nExibir um título para sua história com uma mensagem em um print().\n\nUsar outro print() para copiar a história original (tenha muito cuidado para remover os comentários #).\n\nSubstitua as palavras selecionadas usando as variáveis criadas e concatene-as usando o operador +.",
        "codigo":{ "es": "# Historias para elegir:\n\n# Historia 1\n# La historia se sitúa en el pueblo ficticio de Hawkins, en el estado de Indiana, Estados Unidos, durante los años ochenta,\n# cuando un niño de doce años llamado Will Byers desaparece misteriosamente.\n# Poco después, Eleven, una niña aparentemente fugitiva y con poderes telequinéticos,\n# se encuentra con Mike, Dustin y Lucas, amigos de Will, y los ayuda en la búsqueda de su amigo desaparecido.\n\n# Historia 2\n# La serie sigue la historia de Johnny Lawrence, exestudiante del dojo Cobra Kai,\n# quien busca la redención reabriendo el infame dojo y reavivando, en el proceso,\n# su rivalidad con un ahora exitoso Daniel LaRusso.\n# Este enemigo ha estado luchando por mantener el equilibrio en su vida sin la guía de su mentor, el señor Miyagi.\n# La serie trata sobre dos hombres que enfrentan sus demonios del pasado y\n# resuelven las frustraciones del presente de la única manera en que saben hacerlo: a través del karate.", "en": "# Choose one of these stories:\n\n# Story 1\n# This story takes place in the fictional town of Hawkins, Indiana, US, during the 80's,\n# when a 12-year-old boy called Will Byers mysteriously goes missing.\n# Shortly after, Eleven, an apparently fugitive girl with telekinetic powers, \n# meets Mike, Dustin, and Lucas, Will's friends, and helps them search for their missing friend. \n\n# Story 2\n# This series follows the story of Johnny Lawrence, a former student at the Cobra Kai dojo.\n# He is now seeking redemption by reopening the infamous dojo,\n# while reigniting old rivalries with the currently successful Daniel LaRusso.\n# This rival has been struggling to maintain balance in his life without the guidance of his mentor, Mr. Miyagi.\n# The series is about two men confronting their past demons and\n# dealing with present frustrations in the only way they know: through karate." }
    },
    {
        "id": "tipoDatos-01-01",
        "clase": "PYTH_1000 - C02 - Tipos de Datos",
        "es": "Instrucciones\n\nCorrigiendo el error\n\nEn este ejercicio el código presenta un error y debemos corregirlo.\n\nQueremos conocer el resultado de la suma entre los valores almacenados en las variables numA y numB",
        "en": "Instructions\n\nCorrecting the error\n\nIn this exercise, the code presents an error and we must correct it.\n\nWe want to know the result of the sum between the values stored in the variables numA and numB.",
        "pt": "Instruções\n\nCorrigindo o erro\n\nNeste exercício, o código apresenta um erro e devemos corrigi-lo.\n\nQueremos conhecer o resultado da soma entre os valores armazenados nas variáveis numA e numB.",
        "codigo":{ "es": "print(\"---Actividad 01 - Errores ---\"); \n# --- ERROR 1 ---\n# Queremos saber el total de la suma de los números a y b.\nnumA = 2\nnumB = \"3\"\ntotal = numA + numB\nprint(total)", "en": "print(\"---Activity 01 - Errors ---\"); \n# --- ERROR 1 ---\n# We want to know the total sum of the numbers a and b.\nnumA = 2\nnumB = \"3\"\ntotal = numA + numB\nprint(total)", "pt": "print(\"---Atividade 01 - Erros ---\"); \n# --- ERRO 1 ---\n# Queremos saber o total da soma dos números a e b.\nnumA = 2\nnumB = \"3\"\ntotal = numA + numB\nprint(total)" }
    },
    {
        "id": "tipoDatos-01-02",
        "clase": "PYTH_1000 - C02 - Tipos de Datos",
        "es": "Instrucciones\n\nCorrigiendo el error\nEl código presenta un error y debemos corregirlo.\n\nEn este caso queremos mostrar por consola el sabor de helado ingresado por el usuario.",
        "en": "Instructions\n\nCorrecting the error\nThe code presents an error and we must correct it.\n\nIn this case, we want to display the ice cream flavor entered by the user in the console.",
        "pt": "Instruções\n\nCorrigindo o erro\nO código apresenta um erro e devemos corrigi-lo.\n\nNeste caso, queremos exibir o sabor do sorvete inserido pelo usuário no console.",
        "codigo":{ 
            "es": "# --- ERROR 2 ---\n# Queremos mostrar por consola el sabor de helado ingresado por el usuario.\n\nsabor = int(input(\"Ingrese su sabor de helado favorito: \"))\nprint(\"El sabor ingresado por consola es: \" + sabor)", 
            "en": "# --- ERROR 2 ---\n# We want to show the ice cream flavor entered by the user on the console.\n\nflavor = int(input(\"Enter your favorite ice cream flavor: \"))\nprint(\"The flavor entered on the console is: \" + sabor)", 
            "pt": "# --- ERRO 2 ---\n# Queremos mostrar na tela o sabor do sorvete inserido pelo usuário.\n\nsabor = int(input(\"Digite seu sabor de sorvete favorito: \"))\nprint(\"O sabor inserido no console é: \" + sabor)" 
        }
    },
    {
        "id": "tipoDatos-01-03",
        "clase": "PYTH_1000 - C02 - Tipos de Datos",
        "es": "Instrucciones\n\nCorrigiendo el error\nEl código se encuentra incompleto y no funciona correctamente por lo que deberás corregirlo.\n\nQueremos mostrar por consola el total de la multiplicación de dos números, numA y numB.",
        "en": "Instructions\n\nCorrecting the error\nThe code is incomplete and does not work correctly, so you must correct it.\n\nWe want to display the total of the multiplication of two numbers, numA and numB, in the console.",
        "pt": "Instruções\n\nCorrigindo o erro\nO código está incompleto e não funciona corretamente, então você deve corrigi-lo.\n\nQueremos exibir o total da multiplicação de dois números, numA e numB, no console.",
        "codigo": { 
            "es": "# --- ERROR 3 ---\n# Queremos mostrar por consola el total de la multiplicación de dos números, numA y numB\n\nnumA = input(\"Ingrese número A: \")\nnumB = input(\"Ingrese número B: \")\nresultado = numA * numB\nprint(\"El resultado es: \" + resultado)", 
            "en": "# --- ERROR 3 ---\n# We want to show the total multiplication of two numbers, numA and numB\n\nnumA = input(\"Enter number A: \")\nnumB = input(\"Enter number B: \")\nresult = numA * numB\nprint(\"The result is: \" + result)", 
            "pt": "# --- ERRO 3 ---\n# Queremos mostrar na tela o total da multiplicação de dois números, numA e numB\n\nnumA = input(\"Digite o número A: \")\nnumB = input(\"Digite o número B: \")\nresultado = numA * numB\nprint(\"O resultado é: \" + resultado)" 
        }
    },
    {
        "id": "tipoDatos-02",
        "clase": "PYTH_1000 - C02 - Tipos de Datos",
        "es": "Instrucciones\n\nCalcula tu edad en 18 años con Python\n\nEn esta actividad, vas a interactuar con el usuario mediante la creación de variables, transformar tipos de datos, realizar operaciones matemáticas simples y concatenar texto. El objetivo es calcular y mostrar la edad que tendrá el usuario dentro de 18 años\n\nEn tu archivo main deberás:\n\nUtilizar un input() que consulte la edad al usuario y almacene su valor en una variable llamada edad.\n\nTransformar el tipo de dato almacenado en la variable edad a número entero, sumarle 18 y almacenar el resultado en una variable llamada edadFutura.\n\nTransformar el tipo de dato de la variable edadFutura a texto y concatenarlo en un print() con el texto → “Tu edad dentro de 18 años será: ______”.",
        "en": "Instructions\n\nCalculate your age in 18 years with Python\n\nIn this activity, you will interact with the user by creating variables, transforming data types, performing simple mathematical operations, and concatenating text. The objective is to calculate and display the age the user will be in 18 years.\n\nIn your main file you must:\n\nUse an input() to ask the user for their age and store the value in a variable called age.\n\nTransform the data type stored in the age variable to an integer, add 18 to it, and store the result in a variable called futureAge.\n\nTransform the data type of the futureAge variable to text and concatenate it in a print() with the text → “Your age in 18 years will be: ______”.",
        "pt": "Instruções\n\nCalcule sua idade em 18 anos com Python\n\nNesta atividade, você interagirá com o usuário criando variáveis, transformando tipos de dados, realizando operações matemáticas simples e concatenando texto. O objetivo é calcular e mostrar a idade que o usuário terá em 18 anos.\n\nNo seu arquivo principal, você deve:\n\nUsar um input() que pergunte a idade do usuário e armazene seu valor em uma variável chamada idade.\n\nTransformar o tipo de dado armazenado na variável idade em um número inteiro, somar 18 e armazenar o resultado em uma variável chamada idadeFutura.\n\nTransformar o tipo de dado da variável idadeFutura em texto e concatená-lo em um print() com o texto → “Sua idade em 18 anos será: ______”.",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id": "modulo-01",
        "clase": "PYTH_1000 - C03 - Módulos",
        "es": "Instrucciones\n\nNúmeros aleatorios en Python\nEste ejercicio te permitirá familiarizarte con el uso del módulo random en Python para generar números aleatorios, trabajar con variables y realizar operaciones matemáticas. Además, reforzarás la concatenación de texto y números para mostrar resultados en pantalla\n\nEn tu archivo main deberás:\nImportar el módulo random.\nCrear las variables num1, num2, num3, num4 y num5, donde cada una guarde un número aleatorio generado con la función random.randint(0, 20) para generar un número aleatorio entre 0 y 20 (ambos incluidos).\nHacer un print() de cada variable para mostrar su valor.\nSumar los números generados y guardar el resultado en una variable llamada total.\nHacer un print() con el texto \"La suma de los números generados es: \" y concatenar el resultado de la suma.",
        "en": "Instructions\n\nRandom numbers in Python\nThis exercise will allow you to familiarize yourself with the use of the random module in Python to generate random numbers, work with variables, and perform mathematical operations. Additionally, you will reinforce text and number concatenation to display results on the screen.\n\nIn your main file you must:\nImport the random module.\nCreate the variables num1, num2, num3, num4, and num5, where each one stores a random number generated with the function random.randint(0, 20) to generate a random number between 0 and 20 (both included).\nPrint each variable to display its value.\nSum the generated numbers and store the result in a variable called total.\nMake a print() with the text \"The sum of the generated numbers is: \" and concatenate the result of the sum.",
        "pt": "Instruções\n\nNúmeros aleatórios em Python\nEste exercício permitirá que você se familiarize com o uso do módulo random em Python para gerar números aleatórios, trabalhar com variáveis e realizar operações matemáticas. Além disso, você reforçará a concatenação de texto e números para exibir resultados na tela.\n\nNo seu arquivo principal, você deve:\nImportar o módulo random.\nCriar as variáveis num1, num2, num3, num4 e num5, onde cada uma armazena um número aleatório gerado com a função random.randint(0, 20) para gerar um número aleatório entre 0 e 20 (ambos incluídos).\nImprimir cada variável para exibir seu valor.\nSomar os números gerados e armazenar o resultado em uma variável chamada total.\nFazer um print() com o texto \"A soma dos números gerados é: \" e concatenar o resultado da soma.",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id": "modulo-02",
        "clase": "PYTH_1000 - C03 - Módulos",
        "es": "Instrucciones\n\nCálculo de tu edad usando el módulo datetime en Python\nEste ejercicio te ayudará a trabajar con fechas y horas en Python utilizando el módulo datetime. Aprenderás a obtener la fecha actual, manejar fechas específicas, realizar cálculos con diferencias entre fechas y extraer valores como días y años. También reforzarás el uso de operaciones matemáticas y concatenación de texto con resultados\n\nEn tu archivo main deberás:\nImportar el módulo datetime.\nCrear una variable llamada ahora y guardar la fecha actual utilizando la función datetime.datetime.now(). Luego, realizar un print() de la variable ahora.\nCrear una variable llamada fecha y guardar la fecha de tu cumpleaños utilizando la función datetime.datetime(AÑO, MES, DÍA). Luego, realizar un print() de la variable fecha.\nCrear una variable llamada diferencia, que guarde el resultado de restar las variables ahora y fecha. Luego, realizar un print() de la variable diferencia.\nCrear una variable llamada diferenciaEnDias y guardar solo los días de la resta anterior usando diferencia.days. Luego, realizar un print() de la variable diferenciaEnDias.\nCrear una variable llamada anios, que guarde el resultado de dividir la variable diferenciaEnDias entre 365. Luego, realizar un print() de la variable anios.\nRealizar un print() con el texto → \"Tengo ____ años\" (usando concatenación).\nAtención: Dentro de la concatenación deberás utilizar el método int() sobre la variable anios para eliminar los decimales y luego convertirlo a cadena de texto con el método str() para poder concatenar correctamente.",
        "en": "Instructions\n\nCalculating your age using the datetime module in Python\nThis exercise will help you work with dates and times in Python using the datetime module. You will learn to get the current date, handle specific dates, perform calculations with differences between dates, and extract values such as days and years. You will also reinforce the use of mathematical operations and text concatenation with results.\n\nIn your main file you must:\nImport the datetime module.\nCreate a variable called now and store the current date using the function datetime.datetime.now(). Then, print the now variable.\nCreate a variable called date and store your birthday using the function datetime.datetime(YEAR, MONTH, DAY). Then, print the date variable.\nCreate a variable called difference, which stores the result of subtracting the now and date variables. Then, print the difference variable.\nCreate a variable called differenceInDays and store only the days from the previous subtraction using difference.days. Then, print the differenceInDays variable.\nCreate a variable called years, which stores the result of dividing the differenceInDays variable by 365. Then, print the years variable.\nMake a print() with the text → \"I am ____ years old\" (using concatenation).\nAttention: Within the concatenation you must use the int() method on the years variable to remove the decimals and then convert it to a string with the str() method in order to concatenate correctly.",
        "pt": "Instruções\n\nCálculo da sua idade usando o módulo datetime em Python\nEste exercício ajudará você a trabalhar com datas e horas em Python usando o módulo datetime. Você aprenderá a obter a data atual, lidar com datas específicas, realizar cálculos com diferenças entre datas e extrair valores como dias e anos. Você também reforçará o uso de operações matemáticas e concatenação de texto com resultados.\n\nNo seu arquivo principal, você deve:\nImportar o módulo datetime.\nCriar uma variável chamada agora e armazenar a data atual usando a função datetime.datetime.now(). Em seguida, imprimir a variável agora.\nCriar uma variável chamada data e armazenar a data do seu aniversário usando a função datetime.datetime(ANO, MÊS, DIA). Em seguida, imprimir a variável data.\nCriar uma variável chamada diferença, que armazena o resultado da subtração das variáveis agora e data. Em seguida, imprimir a variável diferença.\nCriar uma variável chamada diferençaEmDias e armazenar apenas os dias da subtração anterior usando diferença.days. Em seguida, imprimir a variável diferençaEmDias.\nCriar uma variável chamada anos, que armazena o resultado da divisão da variável diferençaEmDias por 365. Em seguida, imprimir a variável anos.\nFazer um print() com o texto → \"Eu tenho ____ anos\" (usando concatenação).\nAtenção: Dentro da concatenação, você deve usar o método int() na variável anos para remover os decimais e depois convertê-lo em uma string com o método str() para poder concatenar corretamente.",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id": "funciones-01",
        "clase": "PYTH_1000 - C01 - Funciones",
        "es": "Instrucciones\n\nCálculo de densidad utilizando funciones en Python\n\nEste ejercicio te permitirá practicar la creación y uso de funciones en Python, además de reforzar conceptos como el paso de argumentos, almacenamiento de valores en variables y la manipulación de datos con operaciones matemáticas. Aprenderás a calcular densidades y trabajar con textos concatenados para mostrar resultados\n\nEn tu archivo main deberás:\n\nCrear una función llamada calcular_densidad que contenga dos parámetros (masa y volumen) y que calcule la densidad a partir de los argumentos que reciba (masa / volumen). Recuerda utilizar return para devolver el resultado de la operación matemática.\n\nGuardar en una variable con nombre densidad1, la densidad de un objeto con masa de 10 kg y un volumen de 2 m3. Mostrar el resultado por consola.\n\nGuardar en una variable con nombre densidad2, la densidad de un objeto con masa de 270 kg y un volumen de 33 m3. Mostrar el resultado por consola.\n\nRealizar un print() con el texto → “La densidad total es: _____” (usando concatenación)\n\nAtención: Dentro de la concatenación deberás sumar ambas densidades y convertir su resultado a cadena de texto para poder concatenar correctamente.",
        "en": "Instructions\n\nDensity calculation using functions in Python\n\nThis exercise will allow you to practice creating and using functions in Python, as well as reinforcing concepts such as passing arguments, storing values in variables, and manipulating data with mathematical operations. You will learn to calculate densities and work with concatenated texts to display results.\n\nIn your main file you must:\n\nCreate a function called calculate_density that contains two parameters (mass and volume) and that calculates the density from the arguments it receives (mass / volume). Remember to use return to return the result of the mathematical operation.\n\nStore in a variable named density1 the density of an object with a mass of 10 kg and a volume of 2 m3. Display the result in the console.\n\nStore in a variable named density2 the density of an object with a mass of 270 kg and a volume of 33 m3. Display the result in the console.\n\nMake a print() with the text → “The total density is: _____” (using concatenation)\n\nAttention: Within the concatenation you must add both densities and convert its result to a string in order to concatenate correctly.",
        "pt": "Instruções\n\nCálculo de densidade usando funções em Python\n\nEste exercício permitirá que você pratique a criação e o uso de funções em Python, além de reforçar conceitos como passagem de argumentos, armazenamento de valores em variáveis e manipulação de dados com operações matemáticas. Você aprenderá a calcular densidades e trabalhar com textos concatenados para exibir resultados.\n\nNo seu arquivo principal, você deve:\n\nCriar uma função chamada calcular_densidade que contenha dois parâmetros (massa e volume) e que calcule a densidade a partir dos argumentos que recebe (massa / volume). Lembre-se de usar return para retornar o resultado da operação matemática.\n\nArmazenar em uma variável chamada densidade1 a densidade de um objeto com massa de 10 kg e volume de 2 m3. Exibir o resultado no console.\n\nArmazenar em uma variável chamada densidade2 a densidade de um objeto com massa de 270 kg e volume de 33 m3. Exibir o resultado no console.\n\nFazer um print() com o texto → “A densidade total é: _____” (usando concatenação)\n\nAtenção: Dentro da concatenação, você deve adicionar ambas as densidades e converter seu resultado em uma string para poder concatenar corretamente.",
        "codigo":{"es":"", "en":"", "pt":""}

    },
    {
        "id": "e9",
        "es": "Obtener el promedio de una lista de números.",
        "en": "Get the average of a list of numbers.",
        "pt": "Obtenha a média de uma lista de números.",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id": "e10",
        "es": "Verificar si un número es primo.",
        "en": "Check if a number is prime.",
        "pt": "Verifique se um número é primo.",
        "codigo":{"es":"", "en":"", "pt":""}
    }
]