[
    {
        "id": "intro-01",
        "clase": "PYTH_1000 - C01 - Introducción",
        "es": "Instrucciones\n\nPersonalizar tu historia\n\nEn este ejercicio vas a personalizar una historia usando la función input() y concatenación con el operador +. Debes elegir una sola de las dos historias propuestas. Copia ambas historias como comentarios en tu código (usando # al inicio de cada línea). Dentro de la historia elegida, marca cinco palabras que vas a reemplazar encerrándolas entre corchetes [ ] dentro de esos comentarios, para indicar cuáles serán reemplazadas. Luego, crea cinco variables con input() para que el usuario ingrese los valores que reemplazarán las palabras seleccionadas. Mostrá un título descriptivo de la historia con un print() y usá otro print() para mostrar solo la historia personalizada (sin mostrar la historia original en pantalla). Todas las partes del texto deben concatenarse únicamente con el operador +, y no se debe imprimir dos veces la misma historia.",
        "en": "Instructions\n\nCustomize your story\n\nIn this exercise, you will customize a story using the input() function and concatenation with the + operator. You must choose only one of the two proposed stories. Copy both stories as comments in your code (using # at the beginning of each line). Within the chosen story, mark five words to be replaced by enclosing them in brackets [ ] within those comments to indicate which ones will be replaced. Then, create five variables with input() for the user to enter the values that will replace the selected words. Display a descriptive title of the story with a print() and use another print() to show only the personalized story (without displaying the original story on the screen). All parts of the text must be concatenated only with the + operator, and the same story should not be printed twice.",
        "pt": "Instruções\n\nPersonalize sua história\n\nNeste exercício, você personalizará uma história usando a função input() e concatenação com o operador +. Você deve escolher apenas uma das duas histórias propostas. Copie ambas as histórias como comentários em seu código (usando # no início de cada linha). Dentro da história escolhida, marque cinco palavras que serão substituídas, colocando-as entre colchetes [ ] dentro desses comentários para indicar quais serão substituídas. Em seguida, crie cinco variáveis com input() para que o usuário insira os valores que substituirão as palavras selecionadas. Exiba um título descritivo da história com um print() e use outro print() para mostrar apenas a história personalizada (sem exibir a história original na tela). Todas as partes do texto devem ser concatenadas apenas com o operador +, e a mesma história não deve ser impressa duas vezes.",
        "codigo":{ "es": "# Historias para elegir:\n\n# Historia 1\n# La historia se sitúa en el pueblo ficticio de Hawkins, en el estado de Indiana, Estados Unidos, durante los años ochenta,\n# cuando un niño de doce años llamado Will Byers desaparece misteriosamente.\n# Poco después, Eleven, una niña aparentemente fugitiva y con poderes telequinéticos,\n# se encuentra con Mike, Dustin y Lucas, amigos de Will, y los ayuda en la búsqueda de su amigo desaparecido.\n\n# Historia 2\n# La serie sigue la historia de Johnny Lawrence, exestudiante del dojo Cobra Kai,\n# quien busca la redención reabriendo el infame dojo y reavivando, en el proceso,\n# su rivalidad con un ahora exitoso Daniel LaRusso.\n# Este enemigo ha estado luchando por mantener el equilibrio en su vida sin la guía de su mentor, el señor Miyagi.\n# La serie trata sobre dos hombres que enfrentan sus demonios del pasado y\n# resuelven las frustraciones del presente de la única manera en que saben hacerlo: a través del karate.", "en": "# Choose one of these stories:\n\n# Story 1\n# This story takes place in the fictional town of Hawkins, Indiana, US, during the 80's,\n# when a 12-year-old boy called Will Byers mysteriously goes missing.\n# Shortly after, Eleven, an apparently fugitive girl with telekinetic powers, \n# meets Mike, Dustin, and Lucas, Will's friends, and helps them search for their missing friend. \n\n# Story 2\n# This series follows the story of Johnny Lawrence, a former student at the Cobra Kai dojo.\n# He is now seeking redemption by reopening the infamous dojo,\n# while reigniting old rivalries with the currently successful Daniel LaRusso.\n# This rival has been struggling to maintain balance in his life without the guidance of his mentor, Mr. Miyagi.\n# The series is about two men confronting their past demons and\n# dealing with present frustrations in the only way they know: through karate." , "pt": "# Escolha uma dessas histórias:\n\n# História 1\n# Esta história se passa na cidade fictícia de Hawkins, Indiana, EUA, durante os anos 80,\n# quando um menino de 12 anos chamado Will Byers desaparece misteriosamente.\n# Pouco depois, Eleven, uma garota aparentemente fugitiva com poderes telecinéticos,\n# encontra Mike, Dustin e Lucas, amigos de Will, e os ajuda a procurar seu amigo desaparecido.\n\n# História 2\n# Esta série segue a história de Johnny Lawrence, um ex-aluno do dojo Cobra Kai.\n# Ele agora busca redenção reabrindo o infame dojo,\n# enquanto reacende antigas rivalidades com o atualmente bem-sucedido Daniel LaRusso.\n# Este rival tem lutado para manter o equilíbrio em sua vida sem a orientação de seu mentor, Sr. Miyagi.\n# A série é sobre dois homens confrontando seus demônios do passado e\n# lidando com frustrações presentes da única maneira que conhecem: através do caratê." }
    },
    {
        "id": "tipoDatos-01-01",
        "clase": "PYTH_1000 - C02 - Tipos de Datos",
        "es": "Instrucciones\n\nCorrigiendo el error\n\nEn este ejercicio el código presenta un error y debemos corregirlo.\n\nQueremos conocer el resultado de la suma entre los valores almacenados en las variables numA y numB",
        "en": "Instructions\n\nCorrecting the error\n\nIn this exercise, the code presents an error and we must correct it.\n\nWe want to know the result of the sum between the values stored in the variables numA and numB.",
        "pt": "Instruções\n\nCorrigindo o erro\n\nNeste exercício, o código apresenta um erro e devemos corrigi-lo.\n\nQueremos conhecer o resultado da soma entre os valores armazenados nas variáveis numA e numB.",
        "codigo":{ "es": "print(\"---Actividad 01 - Errores ---\"); \n# --- ERROR 1 ---\n# Queremos saber el total de la suma de los números a y b.\nnumA = 2\nnumB = \"3\"\ntotal = numA + numB\nprint(total)", "en": "print(\"---Activity 01 - Errors ---\"); \n# --- ERROR 1 ---\n# We want to know the total sum of the numbers a and b.\nnumA = 2\nnumB = \"3\"\ntotal = numA + numB\nprint(total)", "pt": "print(\"---Atividade 01 - Erros ---\"); \n# --- ERRO 1 ---\n# Queremos saber o total da soma dos números a e b.\nnumA = 2\nnumB = \"3\"\ntotal = numA + numB\nprint(total)" }
    },
    {
        "id": "tipoDatos-01-02",
        "clase": "PYTH_1000 - C02 - Tipos de Datos",
        "es": "Instrucciones\n\nCorrigiendo el error\nEl código presenta un error y debemos corregirlo.\n\nEn este caso queremos mostrar por consola el sabor de helado ingresado por el usuario.",
        "en": "Instructions\n\nCorrecting the error\nThe code presents an error and we must correct it.\n\nIn this case, we want to display the ice cream flavor entered by the user in the console.",
        "pt": "Instruções\n\nCorrigindo o erro\nO código apresenta um erro e devemos corrigi-lo.\n\nNeste caso, queremos exibir o sabor do sorvete inserido pelo usuário no console.",
        "codigo":{ 
            "es": "# --- ERROR 2 ---\n# Queremos mostrar por consola el sabor de helado ingresado por el usuario.\n\nsabor = int(input(\"Ingrese su sabor de helado favorito: \"))\nprint(\"El sabor ingresado por consola es: \" + sabor)", 
            "en": "# --- ERROR 2 ---\n# We want to show the ice cream flavor entered by the user on the console.\n\nflavor = int(input(\"Enter your favorite ice cream flavor: \"))\nprint(\"The flavor entered on the console is: \" + sabor)", 
            "pt": "# --- ERRO 2 ---\n# Queremos mostrar na tela o sabor do sorvete inserido pelo usuário.\n\nsabor = int(input(\"Digite seu sabor de sorvete favorito: \"))\nprint(\"O sabor inserido no console é: \" + sabor)" 
        }
    },
    {
        "id": "tipoDatos-01-03",
        "clase": "PYTH_1000 - C02 - Tipos de Datos",
        "es": "Instrucciones\n\nCorrigiendo el error\nEl código se encuentra incompleto y no funciona correctamente por lo que deberás corregirlo.\n\nQueremos mostrar por consola el total de la multiplicación de dos números, numA y numB.",
        "en": "Instructions\n\nCorrecting the error\nThe code is incomplete and does not work correctly, so you must correct it.\n\nWe want to display the total of the multiplication of two numbers, numA and numB, in the console.",
        "pt": "Instruções\n\nCorrigindo o erro\nO código está incompleto e não funciona corretamente, então você deve corrigi-lo.\n\nQueremos exibir o total da multiplicação de dois números, numA e numB, no console.",
        "codigo": { 
            "es": "# --- ERROR 3 ---\n# Queremos mostrar por consola el total de la multiplicación de dos números, numA y numB\n\nnumA = input(\"Ingrese número A: \")\nnumB = input(\"Ingrese número B: \")\nresultado = numA * numB\nprint(\"El resultado es: \" + resultado)", 
            "en": "# --- ERROR 3 ---\n# We want to show the total multiplication of two numbers, numA and numB\n\nnumA = input(\"Enter number A: \")\nnumB = input(\"Enter number B: \")\nresult = numA * numB\nprint(\"The result is: \" + result)", 
            "pt": "# --- ERRO 3 ---\n# Queremos mostrar na tela o total da multiplicação de dois números, numA e numB\n\nnumA = input(\"Digite o número A: \")\nnumB = input(\"Digite o número B: \")\nresultado = numA * numB\nprint(\"O resultado é: \" + resultado)" 
        }
    },
    {
        "id": "tipoDatos-02",
        "clase": "PYTH_1000 - C02 - Tipos de Datos",
        "es": "Instrucciones\n\nCalcula tu edad en 18 años con Python\n\nEn esta actividad, vas a interactuar con el usuario mediante la creación de variables, transformar tipos de datos, realizar operaciones matemáticas simples y concatenar texto. El objetivo es calcular y mostrar la edad que tendrá el usuario dentro de 18 años\n\nEn tu archivo main deberás:\n\nUtilizar un input() que consulte la edad al usuario y almacene su valor en una variable llamada edad.\n\nTransformar el tipo de dato almacenado en la variable edad a número entero, sumarle 18 y almacenar el resultado en una variable llamada edadFutura.\n\nTransformar el tipo de dato de la variable edadFutura a texto y concatenarlo en un print() con el texto → “Tu edad dentro de 18 años será: ______”.",
        "en": "Instructions\n\nCalculate your age in 18 years with Python\n\nIn this activity, you will interact with the user by creating variables, transforming data types, performing simple mathematical operations, and concatenating text. The objective is to calculate and display the age the user will be in 18 years.\n\nIn your main file you must:\n\nUse an input() to ask the user for their age and store the value in a variable called age.\n\nTransform the data type stored in the age variable to an integer, add 18 to it, and store the result in a variable called futureAge.\n\nTransform the data type of the futureAge variable to text and concatenate it in a print() with the text → “Your age in 18 years will be: ______”.",
        "pt": "Instruções\n\nCalcule sua idade em 18 anos com Python\n\nNesta atividade, você interagirá com o usuário criando variáveis, transformando tipos de dados, realizando operações matemáticas simples e concatenando texto. O objetivo é calcular e mostrar a idade que o usuário terá em 18 anos.\n\nNo seu arquivo principal, você deve:\n\nUsar um input() que pergunte a idade do usuário e armazene seu valor em uma variável chamada idade.\n\nTransformar o tipo de dado armazenado na variável idade em um número inteiro, somar 18 e armazenar o resultado em uma variável chamada idadeFutura.\n\nTransformar o tipo de dado da variável idadeFutura em texto e concatená-lo em um print() com o texto → “Sua idade em 18 anos será: ______”.",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id": "modulo-01",
        "clase": "PYTH_1000 - C03 - Módulos",
        "es": "Instrucciones\n\nNúmeros aleatorios en Python\nEste ejercicio te permitirá familiarizarte con el uso del módulo random en Python para generar números aleatorios, trabajar con variables y realizar operaciones matemáticas. Además, reforzarás la concatenación de texto y números para mostrar resultados en pantalla\n\nEn tu archivo main deberás:\nImportar el módulo random.\nCrear las variables num1, num2, num3, num4 y num5, donde cada una guarde un número aleatorio generado con la función random.randint(0, 20) para generar un número aleatorio entre 0 y 20 (ambos incluidos).\nHacer un print() de cada variable para mostrar su valor.\nSumar los números generados y guardar el resultado en una variable llamada total.\nHacer un print() con el texto \"La suma de los números generados es: \" y concatenar el resultado de la suma.",
        "en": "Instructions\n\nRandom numbers in Python\nThis exercise will allow you to familiarize yourself with the use of the random module in Python to generate random numbers, work with variables, and perform mathematical operations. Additionally, you will reinforce text and number concatenation to display results on the screen.\n\nIn your main file you must:\nImport the random module.\nCreate the variables num1, num2, num3, num4, and num5, where each one stores a random number generated with the function random.randint(0, 20) to generate a random number between 0 and 20 (both included).\nPrint each variable to display its value.\nSum the generated numbers and store the result in a variable called total.\nMake a print() with the text \"The sum of the generated numbers is: \" and concatenate the result of the sum.",
        "pt": "Instruções\n\nNúmeros aleatórios em Python\nEste exercício permitirá que você se familiarize com o uso do módulo random em Python para gerar números aleatórios, trabalhar com variáveis e realizar operações matemáticas. Além disso, você reforçará a concatenação de texto e números para exibir resultados na tela.\n\nNo seu arquivo principal, você deve:\nImportar o módulo random.\nCriar as variáveis num1, num2, num3, num4 e num5, scm-history-item:c%3A%5CUsers%5CUSURIO%5CDesktop%5Creact-app-python-runner%20-%20copia?%7B%22repositoryId%22%3A%22scm0%22%2C%22historyItemId%22%3A%2254e54b50c623ade1a36bd7d483b270415cb57625%22%2C%22historyItemDisplayId%22%3A%2254e54b5%22%7Donde cada uma armazena um número aleatório gerado com a função random.randint(0, 20) para gerar um número aleatório entre 0 e 20 (ambos incluídos).\nImprimir cada variável para exibir seu valor.\nSomar os números gerados e armazenar o resultado em uma variável chamada total.\nFazer um print() com o texto \"A soma dos números gerados é: \" e concatenar o resultado da soma.",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id": "modulo-02",
        "clase": "PYTH_1000 - C03 - Módulos",
        "es": "Instrucciones\n\nCálculo de tu edad usando el módulo datetime en Python\nEste ejercicio te ayudará a trabajar con fechas y horas en Python utilizando el módulo datetime. Aprenderás a obtener la fecha actual, manejar fechas específicas, realizar cálculos con diferencias entre fechas y extraer valores como días y años. También reforzarás el uso de operaciones matemáticas y concatenación de texto con resultados\n\nEn tu archivo main deberás:\nImportar el módulo datetime.\nCrear una variable llamada ahora y guardar la fecha actual utilizando la función datetime.datetime.now(). Luego, realizar un print() de la variable ahora.\nCrear una variable llamada fecha y guardar la fecha de tu cumpleaños utilizando la función datetime.datetime(AÑO, MES, DÍA). Luego, realizar un print() de la variable fecha.\nCrear una variable llamada diferencia, que guarde el resultado de restar las variables ahora y fecha. Luego, realizar un print() de la variable diferencia.\nCrear una variable llamada diferenciaEnDias y guardar solo los días de la resta anterior usando diferencia.days. Luego, realizar un print() de la variable diferenciaEnDias.\nCrear una variable llamada anios, que guarde el resultado de dividir la variable diferenciaEnDias entre 365. Luego, realizar un print() de la variable anios.\nRealizar un print() con el texto → \"Tengo ____ años\" (usando concatenación).\nAtención: Dentro de la concatenación deberás utilizar el método int() sobre la variable anios para eliminar los decimales y luego convertirlo a cadena de texto con el método str() para poder concatenar correctamente.",
        "en": "Instructions\n\nCalculating your age using the datetime module in Python\nThis exercise will help you work with dates and times in Python using the datetime module. You will learn to get the current date, handle specific dates, perform calculations with differences between dates, and extract values such as days and years. You will also reinforce the use of mathematical operations and text concatenation with results.\n\nIn your main file you must:\nImport the datetime module.\nCreate a variable called now and store the current date using the function datetime.datetime.now(). Then, print the now variable.\nCreate a variable called date and store your birthday using the function datetime.datetime(YEAR, MONTH, DAY). Then, print the date variable.\nCreate a variable called difference, which stores the result of subtracting the now and date variables. Then, print the difference variable.\nCreate a variable called differenceInDays and store only the days from the previous subtraction using difference.days. Then, print the differenceInDays variable.\nCreate a variable called years, which stores the result of dividing the differenceInDays variable by 365. Then, print the years variable.\nMake a print() with the text → \"I am ____ years old\" (using concatenation).\nAttention: Within the concatenation you must use the int() method on the years variable to remove the decimals and then convert it to a string with the str() method in order to concatenate correctly.",
        "pt": "Instruções\n\nCálculo da sua idade usando o módulo datetime em Python\nEste exercício ajudará você a trabalhar com datas e horas em Python usando o módulo datetime. Você aprenderá a obter a data atual, lidar com datas específicas, realizar cálculos com diferenças entre datas e extrair valores como dias e anos. Você também reforçará o uso de operações matemáticas e concatenação de texto com resultados.\n\nNo seu arquivo principal, você deve:\nImportar o módulo datetime.\nCriar uma variável chamada agora e armazenar a data atual usando a função datetime.datetime.now(). Em seguida, imprimir a variável agora.\nCriar uma variável chamada data e armazenar a data do seu aniversário usando a função datetime.datetime(ANO, MÊS, DIA). Em seguida, imprimir a variável data.\nCriar uma variável chamada diferença, que armazena o resultado da subtração das variáveis agora e data. Em seguida, imprimir a variável diferença.\nCriar uma variável chamada diferençaEmDias e armazenar apenas os dias da subtração anterior usando diferença.days. Em seguida, imprimir a variável diferençaEmDias.\nCriar uma variável chamada anos, que armazena o resultado da divisão da variável diferençaEmDias por 365. Em seguida, imprimir a variável anos.\nFazer um print() com o texto → \"Eu tenho ____ anos\" (usando concatenação).\nAtenção: Dentro da concatenação, você deve usar o método int() na variável anos para remover os decimais e depois convertê-lo em uma string com o método str() para poder concatenar corretamente.",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id": "funciones-01",
        "clase": "PYTH_1000 - C01 - Funciones",
        "es": "Instrucciones\n\nCálculo de densidad utilizando funciones en Python\n\nEste ejercicio te permitirá practicar la creación y uso de funciones en Python, además de reforzar conceptos como el paso de argumentos, almacenamiento de valores en variables y la manipulación de datos con operaciones matemáticas. Aprenderás a calcular densidades y trabajar con textos concatenados para mostrar resultados\n\nEn tu archivo main deberás:\n\nCrear una función llamada calcular_densidad que contenga dos parámetros (masa y volumen) y que calcule la densidad a partir de los argumentos que reciba (masa / volumen). Recuerda utilizar return para devolver el resultado de la operación matemática.\n\nGuardar en una variable con nombre densidad1, la densidad de un objeto con masa de 10 kg y un volumen de 2 m3. Mostrar el resultado por consola.\n\nGuardar en una variable con nombre densidad2, la densidad de un objeto con masa de 270 kg y un volumen de 33 m3. Mostrar el resultado por consola.\n\nRealizar un print() con el texto → “La densidad total es: _____” (usando concatenación)\n\nAtención: Dentro de la concatenación deberás sumar ambas densidades y convertir su resultado a cadena de texto para poder concatenar correctamente.",
        "en": "Instructions\n\nDensity calculation using functions in Python\n\nThis exercise will allow you to practice creating and using functions in Python, as well as reinforcing concepts such as passing arguments, storing values in variables, and manipulating data with mathematical operations. You will learn to calculate densities and work with concatenated texts to display results.\n\nIn your main file you must:\n\nCreate a function called calculate_density that contains two parameters (mass and volume) and that calculates the density from the arguments it receives (mass / volume). Remember to use return to return the result of the mathematical operation.\n\nStore in a variable named density1 the density of an object with a mass of 10 kg and a volume of 2 m3. Display the result in the console.\n\nStore in a variable named density2 the density of an object with a mass of 270 kg and a volume of 33 m3. Display the result in the console.\n\nMake a print() with the text → “The total density is: _____” (using concatenation)\n\nAttention: Within the concatenation you must add both densities and convert its result to a string in order to concatenate correctly.",
        "pt": "Instruções\n\nCálculo de densidade usando funções em Python\n\nEste exercício permitirá que você pratique a criação e o uso de funções em Python, além de reforçar conceitos como passagem de argumentos, armazenamento de valores em variáveis e manipulação de dados com operações matemáticas. Você aprenderá a calcular densidades e trabalhar com textos concatenados para exibir resultados.\n\nNo seu arquivo principal, você deve:\n\nCriar uma função chamada calcular_densidade que contenha dois parâmetros (massa e volume) e que calcule a densidade a partir dos argumentos que recebe (massa / volume). Lembre-se de usar return para retornar o resultado da operação matemática.\n\nArmazenar em uma variável chamada densidade1 a densidade de um objeto com massa de 10 kg e volume de 2 m3. Exibir o resultado no console.\n\nArmazenar em uma variável chamada densidade2 a densidade de um objeto com massa de 270 kg e volume de 33 m3. Exibir o resultado no console.\n\nFazer um print() com o texto → “A densidade total é: _____” (usando concatenação)\n\nAtenção: Dentro da concatenação, você deve adicionar ambas as densidades e converter seu resultado em uma string para poder concatenar corretamente.",
        "codigo":{"es":"", "en":"", "pt":""}

    },
    {
        "id": "funciones-02",
        "clase": "PYTH_1000 - C01 - Funciones",
        "es":"Instrucciones\n\nSimulación de un ataque a un dragón con dados en Python\nEste ejercicio combina el uso del módulo random con funciones personalizadas para simular un ataque a un dragón. Practicarás la generación de números aleatorios, la creación de funciones con y sin argumentos, el uso de variables globales y la manipulación de valores para actualizar datos\n\nEn tu archivo main:\nImportar el módulo random.\nCrear una variable llamada puntos_vida_dragon donde se guarden los puntos de vida del dragón (por ejemplo: 100)\nCrear la función tirarDado() que reciba un parámetro llamado lados. Dentro de la función:\nDeberás retornar un valor aleatorio, entre 1 y el argumento recibido en el parámetro lados. Para esto deberás utilizar el módulo random con el método .randint()\nCrear la función atacarDragon() sin argumento. Dentro de la función:\nDeberás crear una variable llamada ataque que almacene la suma de tirar un dado de 20 lados más uno de 4 lados.\nPor último, deberá retornar el valor contenido en la variable ataque\nSobreescribir el valor de la variable puntos_vida_dragon restando el ataque realizado. Para esto deberás asignar a la variable: su valor original - atacarDragon().\nHacer un print() con el texto 'Los puntos de vida del dragón son: ______'.",
        "en":"Instructions\n\nDragon attack simulation with dice in Python\nThis exercise combines the use of the random module with custom functions to simulate an attack on a dragon. You will practice generating random numbers, creating functions with and without arguments, using global variables, and manipulating values to update data.\n\nIn your main file:\nImport the random module.\nCreate a variable called dragon_life_points where the dragon's life points are stored (for example: 100)\nCreate the function rollDice() that receives a parameter called sides. Inside the function:\nYou must return a random value between 1 and the argument received in the sides parameter. For this, you should use the random module with the .randint() method.\nCreate the function attackDragon() without arguments. Inside the function:\nYou must create a variable called attack that stores the sum of rolling a 20-sided die plus a 4-sided die.\nFinally, it should return the value contained in the attack variable.\nOverwrite the value of the dragon_life_points variable by subtracting the attack performed. To do this, you should assign to the variable: its original value - attackDragon().\nMake a print() with the text 'The dragon's life points are: ______'.",
        "pt":"Instruções\n\nSimulação de um ataque a um dragão com dados em Python\nEste exercício combina o uso do módulo random com funções personalizadas para simular um ataque a um dragão. Você praticará a geração de números aleatórios, a criação de funções com e sem argumentos, o uso de variáveis globais e a manipulação de valores para atualizar dados.\n\nNo seu arquivo principal:\nImportar o módulo random.\nCriar uma variável chamada pontos_vida_dragon onde os pontos de vida do dragão são armazenados (por exemplo: 100)\nCriar a função rolarDado() que recebe um parâmetro chamado lados. Dentro da função:\nVocê deve retornar um valor aleatório entre 1 e o argumento recebido no parâmetro lados. Para isso, você deve usar o módulo random com o método .randint().\nCriar a função atacarDragon() sem argumentos. Dentro da função:\nVocê deve criar uma variável chamada ataque que armazena a soma de rolar um dado de 20 lados mais um de 4 lados.\nPor fim, deve retornar o valor contido na variável ataque.\nSobrescrever o valor da variável pontos_vida_dragon subtraindo o ataque realizado. Para isso, você deve atribuir à variável: seu valor original - atacarDragon().\nFazer um print() com o texto 'Os pontos de vida do dragão são: ______'.",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id": "condicionales-01",
        "clase": "PYTH_1200 - C02 - Condicionales",
        "es": "Instrucciones\n\nEvaluación de la edad para conducir en Python\nEn este ejercicio aprenderás a trabajar con variables, estructuras condicionales (if y else), y a mostrar mensajes por consola según la evaluación de una condición. Es ideal para practicar cómo usar comparaciones y ejecutar bloques de código específicos dependiendo de los resultados\n\nEn tu archivo main:\nCrear una variable llamada edad que guarde la edad del usuario ingresada por consola.\nCrear una estructura condicional que evalúe si el usuario tiene 16 años o más.\nSi la condición se cumple, mostrar por consola el texto “Tienes permitido conducir”.\nEn caso de que la condición no se cumpla, mostrar por consola el texto “No tienes permitido conducir”.",
        "en": "Instructions\n\nDriving age evaluation in Python\nIn this exercise, you will learn to work with variables, conditional structures (if and else), and display messages on the console based on the evaluation of a condition. It is ideal for practicing how to use comparisons and execute specific code blocks depending on the results.\n\nIn your main file:\nCreate a variable called age that stores the user's age entered via console.\nCreate a conditional structure that evaluates if the user is 16 years old or older.\nIf the condition is met, display the text “You are allowed to drive” on the console.\nIf the condition is not met, display the text “You are not allowed to drive” on the console.",
        "pt": "Instruções\n\nAvaliação da idade para dirigir em Python\nNeste exercício, você aprenderá a trabalhar com variáveis, estruturas condicionais (if e else) e exibir mensagens no console com base na avaliação de uma condição. É ideal para praticar como usar comparações e executar blocos de código específicos dependendo dos resultados.\n\nNo seu arquivo principal:\nCriar uma variável chamada idade que armazene a idade do usuário inserida via console.\nCriar uma estrutura condicional que avalie se o usuário tem 16 anos ou mais.\nSe a condição for atendida, exibir o texto “Você tem permissão para dirigir” no console.\nSe a condição não for atendida, exibir o texto “Você não tem permissão para dirigir” no console.",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id": "condicionales-02",
        "clase": "PYTH_1200 - C02 - Condicionales",
        "es": "Instrucciones\n\nVerificación de gusto de helado en Python\nEn este ejercicio aprenderás a trabajar con condicionales para evaluar las respuestas del usuario. Practicarás el uso de la estructura if, comparaciones de cadenas de texto y cómo mostrar diferentes mensajes según el gusto de helado ingresado\n\nEn tu archivo main deberás:\nCrear una variable llamada gustoHelado para guardar el gusto de helado ingresado por el usuario.\nCrear una estructura condicional que evalúe y compare la respuesta con cuatro gustos chocolate, vainilla, fresa y pistacho. Para esto deberás usar los condicionales if, elif y else.\nSi se cumple alguna de las condiciones, mostrar por consola el texto “Sí, hay _____” (concatenar el sabor del usuario).\nEn caso de que el gusto no exista, mostrar por consola el texto “No hay _____” (concatenar el sabor del usuario).",
        "en": "Instructions\n\nIce cream flavor verification in Python\nIn this exercise, you will learn to work with conditionals to evaluate user responses. You will practice using the if structure, string comparisons, and how to display different messages based on the entered ice cream flavor.\n\nIn your main file you must:\nCreate a variable called iceCreamFlavor to store the ice cream flavor entered by the user.\nCreate a conditional structure that evaluates and compares the response with four flavors: chocolate, vanilla, strawberry, and pistachio. For this, you should use the if, elif, and else conditionals.\nIf any of the conditions are met, display the text “Yes, we have _____” on the console (concatenate the user's flavor).\nIf the flavor does not exist, display the text “We don't have _____” on the console (concatenate the user's flavor).",
        "pt": "Instruções\n\nVerificação do sabor do sorvete em Python\nNeste exercício, você aprenderá a trabalhar com condicionais para avaliar as respostas do usuário. Você praticará o uso da estrutura if, comparações de strings e como exibir diferentes mensagens com base no sabor do sorvete inserido.\n\nNo seu arquivo principal, você deve:\nCriar uma variável chamada saborSorvete para armazenar o sabor do sorvete inserido pelo usuário.\nCriar uma estrutura condicional que avalie e compare a resposta com quatro sabores: chocolate, baunilha, morango e pistache. Para isso, você deve usar os condicionais if, elif e else.\nSe alguma das condições for atendida, exibir o texto “Sim, temos _____” no console (concatenar o sabor do usuário).\nSe o sabor não existir, exibir o texto “Não temos _____” no console (concatenar o sabor do usuário).",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id": "while-01",
        "clase": "PYTH_1200 - C03 - Bucles While",
        "es": "Instrucciones\n\nSimulación de juego con dados en Python\nEste ejercicio combina el uso de funciones del módulo random, estructuras de control como bucles (while) y condicionales, además de trabajar con variables para simular un juego en el que el puntaje se acumula mediante tiradas de dados.\n\nEn tu archivo main deberás:\nImportar la función randint del módulo random.\nCrear las siguientes variables con el valor 0:\ndado para guardar el número que salió en una tirada.\ncontador para guardar la cantidad de tiradas.\npuntaje para acumular la suma de los dados.\nCrear un bucle while que se ejecute mientras contador sea menor a 10 y puntaje sea menor a 38.\nDentro del while:\nGuardar en la variable llamada dado el resultado de la función randint(1, 6).\nHacer un print() de dado.\nAlmacenar en la variable llamada puntaje la suma de los dados lanzados.\nIncrementar la variable llamada contador de uno en uno.\nMostrar por consola el texto “El puntaje total es: _____”.\nCrear una estructura condicional para que, si el valor de puntaje es mayor o igual a 38, se muestre por consola el texto “Ganaste”; si es menor, que se muestre el mensaje “Perdiste”.",
        "en": "Instructions\n\nDice game simulation in Python\nThis exercise combines the use of functions from the random module, control structures such as loops (while) and conditionals, as well as working with variables to simulate a game where the score is accumulated through dice rolls.\n\nIn your main file you must:\nImport the randint function from the random module.\nCreate the following variables with the value 0:\ndice to store the number that came up in a roll.\ncounter to store the number of rolls.\nscore to accumulate the sum of the dice.\nCreate a while loop that runs while counter is less than 10 and score is less than 38.\nInside the while:\nStore in the variable called dice the result of the function randint(1, 6).\nMake a print() of dice.\nStore in the variable called score the sum of the rolled dice.\nIncrement the variable called counter by one.\nDisplay on the console the text “The total score is: _____”.\nCreate a conditional structure so that if the value of score is greater than or equal to 38, it displays the text “You won” on the console; if it is less, it shows the message “You lost”.",
        "pt": "Instruções\n\nSimulação de jogo com dados em Python\nEste exercício combina o uso de funções do módulo random, estruturas de controle como loops (while) e condicionais, além de trabalhar com variáveis para simular um jogo onde a pontuação é acumulada através de lançamentos de dados.\n\nNo seu arquivo principal, você deve:\nImportar a função randint do módulo random.\nCriar as seguintes variáveis com o valor 0:\ndado para armazenar o número que saiu em um lançamento.\ncontador para armazenar a quantidade de lançamentos.\npontuação para acumular a soma dos dados.\nCriar um loop while que execute enquanto o contador for menor que 10 e a pontuação for menor que 38.\nDentro do while:\nArmazenar na variável chamada dado o resultado da função randint(1, 6).\nFazer um print() do dado.\nArmazenar na variável chamada pontuação a soma dos dados lançados.\nIncrementar a variável chamada contador de um em um.\nExibir no console o texto “A pontuação total é: _____”.\nCriar uma estrutura condicional para que, se o valor da pontuação for maior ou igual a 38, exiba no console o texto “Você ganhou”; se for menor, mostre a mensagem “Você perdeu”.",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id": "while-02",
        "clase": "PYTH_1200 - C03 - Bucles While",
        "es": "Instrucciones\n\nValidación de contraseña en Python\nEn este ejercicio aprenderás a trabajar con ciclos while y condicionales para verificar la validez de una contraseña. El objetivo es que el usuario ingrese una contraseña y el programa valide si es correcta, solicitándola repetidamente hasta que se ingrese la correcta.\n\nEn tu archivo main deberás:\nCrear una variable llamada clave y asignarle el valor “DigitalHouse”.\nCrear una variable llamada password y guardar la respuesta del usuario a un input() solicitando que ingrese la contraseña.\nCrear un bucle while que se ejecute mientras clave sea distinto a password.\nDentro del while:\nVolver a cambiar el valor de la variable password utilizando un input() que muestre un mensaje indicando que hubo un error e invitando al usuario a intentar nuevamente.\nUna vez finalizado el bucle, mostrar por consola el mensaje: La contraseña ingresada es correcta.",
        "en": "Instructions\n\nPassword validation in Python\nIn this exercise, you will learn to work with while loops and conditionals to verify the validity of a password. The goal is for the user to enter a password and for the program to validate if it is correct, repeatedly asking for it until the correct one is entered.\n\nIn your main file you must:\nCreate a variable called key and assign it the value “DigitalHouse”.\nCreate a variable called password and store the user's response to an input() asking them to enter the password.\nCreate a while loop that runs while key is different from password.\nInside the while:\nChange the value of the password variable again using an input() that displays a message indicating there was an error and inviting the user to try again.\nOnce the loop is finished, display the message: The entered password is correct on the console.",
        "pt": "Instruções\n\nValidação de senha em Python\nNeste exercício, você aprenderá a trabalhar com loops while e condicionais para verificar a validade de uma senha. O objetivo é que o usuário insira uma senha e o programa valide se ela está correta, solicitando-a repetidamente até que a correta seja inserida.\n\nNo seu arquivo principal, você deve:\nCriar uma variável chamada chave e atribuir a ela o valor “DigitalHouse”.\nCriar uma variável chamada senha e armazenar a resposta do usuário em um input() solicitando que ele insira a senha.\nCriar um loop while que execute enquanto chave for diferente de senha.\nDentro do while:\nAlterar novamente o valor da variável senha usando um input() que exiba uma mensagem indicando que houve um erro e convidando o usuário a tentar novamente.\nUma vez finalizado o loop, exibir a mensagem: A senha inserida está correta no console.",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id": "listas01-01",
        "clase": "PYTH_1300 - C01 - Listas 01",
        "es": "Instrucciones\n\nCálculo de suma, cantidad y promedio de notas en Python\nEn este ejercicio trabajarás con listas en Python para realizar cálculos sobre un conjunto de datos. El objetivo es sumar las notas, contar cuántas hay en la lista y calcular su promedio.\n\nEn tu archivo main deberás:\nObtener la suma de las notas de la lista, almacenar el resultado en una variable llamada sumaNotas y mostrarlo por consola con el texto “La suma de las notas es: _____”.\nObtener la cantidad de las notas de la lista, almacenar el resultado en una variable llamada cantidadNotas y mostrarlo por consola con el texto “La cantidad de notas es: _____”.\nCrea una variable llamada promedio y almacenar el promedio de las notas para mostrarlo por consola con el texto “El promedio de las notas es: _____”.",
        "en": "Instructions\n\nCalculation of sum, quantity, and average of grades in Python\nIn this exercise, you will work with lists in Python to perform calculations on a set of data. The goal is to sum the grades, count how many are in the list, and calculate their average.\n\nIn your main file you must:\nObtain the sum of the grades in the list, store the result in a variable called sumGrades, and display it on the console with the text “The sum of the grades is: _____”.\nObtain the quantity of grades in the list, store the result in a variable called quantityGrades, and display it on the console with the text “The quantity of grades is: _____”.\nCreate a variable called average and store the average of the grades to display it on the console with the text “The average of the grades is: _____”.",
        "pt": "Instruções\n\nCálculo da soma, quantidade e média das notas em Python\nNeste exercício, você trabalhará com listas em Python para realizar cálculos sobre um conjunto de dados. O objetivo é somar as notas, contar quantas há na lista e calcular sua média.\n\nNo seu arquivo principal, você deve:\nObter a soma das notas na lista, armazenar o resultado em uma variável chamada somaNotas e exibi-lo no console com o texto “A soma das notas é: _____”.\nObter a quantidade de notas na lista, armazenar o resultado em uma variável chamada quantidadeNotas e exibi-lo no console com o texto “A quantidade de notas é: _____”.\nCriar uma variável chamada média e armazenar a média das notas para exibi-la no console com o texto “A média das notas é: _____”.",
        "codigo":{"es":"notas = [10, 4, 6, 5, 10, 8, 9, 4]", "en":"grades = [10, 4, 6, 5, 10, 8, 9, 4]", "pt":"notas = [10, 4, 6, 5, 10, 8, 9, 4]"}

    },
    {
        "id": "listas01-02",
        "clase": "PYTH_1300 - C01 - Listas 01",
        "es": "Instrucciones\n\nManipulación de listas de animales en Python>\nEn este ejercicio practicarás el uso de métodos para manipular listas en Python.\n\nEn tu archivo main deberás:\nUtilizar la técnica correspondiente para extraer los animales salvajes de la lista y almacenarlos en una variable llamada animalesSalvajes. Luego, deberás ordenar la nueva lista por orden alfabético utilizando el método apropiado.\nUtilizar la técnica correspondiente para extraer los animales domésticos de la lista y almacenarlos en una variable llamada animalesDomesticos. Luego, deberás ordenar la lista por orden alfabético utilizando el método apropiado.\nMostrar por consola las variables animalesSalvajes y animalesDomesticos.",
        "en": "Instructions\n\nManipulation of animal lists in Python\nIn this exercise, you will practice using methods to manipulate lists in Python.\n\nIn your main file you must:\nUse the appropriate technique to extract the wild animals from the list and store them in a variable called wildAnimals. Then, you should sort the new list in alphabetical order using the appropriate method.\nUse the appropriate technique to extract the domestic animals from the list and store them in a variable called domesticAnimals. Then, you should sort the list in alphabetical order using the appropriate method.\nDisplay the variables wildAnimals and domesticAnimals on the console.",
        "pt": "Instruções\n\nManipulação de listas de animais em Python\nNeste exercício, você praticará o uso de métodos para manipular listas em Python.\n\nNo seu arquivo principal, você deve:\nUsar a técnica apropriada para extrair os animais selvagens da lista e armazená-los em uma variável chamada animaisSelvagens. Em seguida, você deve ordenar a nova lista em ordem alfabética usando o método apropriado.\nUsar a técnica apropriada para extrair os animais domésticos da lista e armazená-los em uma variável chamada animaisDomésticos. Em seguida, você deve ordenar a lista em ordem alfabética usando o método apropriado.\nExibir as variáveis animaisSelvagens e animaisDomésticos no console.",
        "codigo":{"es":"animales = [\"Avestruz\", \"León\", \"Elefante\", \"Gorila\", \"Ballenas\", \"Caballo\", \"Gallina\", \"Hámster\", \"Perro\", \"Gato\"]","en":"animals = [\"Ostrich\", \"Lion\", \"Elephant\", \"Gorilla\", \"Whales\", \"Horse\", \"Chicken\", \"Hamster\", \"Dog\", \"Cat\"]","pt":"animais = [\"Avestruz\", \"Leão\", \"Elefante\", \"Gorila\", \"Baleias\", \"Cavalo\", \"Galinha\", \"Hamster\", \"Cachorro\", \"Gato\"]"}
    },
    {
        "id": "listas01-03",
        "clase": "PYTH_1300 - C01 - Listas 01",
        "es": "Instrucciones\n\nModificación y manipulación de listas de frutas en Python\nEn este ejercicio, practicarás cómo modificar elementos dentro de una lista, ordenarla alfabéticamente, verificar la presencia de un elemento y realizar otras manipulaciones en Python. El objetivo es trabajar con una lista de frutas, cambiar algunos elementos, ordenarla, verificar la presencia de un elemento y realizar un cambio de orden.\n\nEn tu archivo main:\nCambiar los siguientes elementos:\n“Patata” por “Fresa”\n“Tomate” por “Manzana”\n“Cebolla” por “Durazno”\nOrdenar la lista por orden alfabético.\nMostrar por consola la lista modificada.\nCrear una condición para verificar si “maracuyá” se encuentra en la lista de frutas.\nSi la condición se cumple, mostrar por consola “Sí, hay maracuyá”; en caso de que no, mostrar “No hay maracuyá”.\nInvertir el orden de la lista y mostrar por consola la lista modificada.",
        "en": "Instructions\n\nModification and manipulation of fruit lists in Python\nIn this exercise, you will practice how to modify elements within a list, sort it alphabetically, check for the presence of an element, and perform other manipulations in Python. The goal is to work with a list of fruits, change some elements, sort it, check for the presence of an element, and perform a change of order.\n\nIn your main file:\nChange the following elements:\n“Potato” to “Strawberry”\n“Tomato” to “Apple”\n“Onion” to “Peach”\nSort the list in alphabetical order.\nDisplay the modified list on the console.\nCreate a condition to check if “passion fruit” is in the fruit list.\nIf the condition is met, display “Yes, there is passion fruit” on the console; otherwise, display “There is no passion fruit”.\nReverse the order of the list and display the modified list on the console.",
        "pt": "Instruções\n\nModificação e manipulação de listas de frutas em Python\nNeste exercício, você praticará como modificar elementos dentro de uma lista, ordená-la alfabeticamente, verificar a presença de um elemento e realizar outras manipulações em Python. O objetivo é trabalhar com uma lista de frutas, mudar alguns elementos, ordená-la, verificar a presença de um elemento e realizar uma mudança de ordem.\n\nNo seu arquivo principal:\nMudar os seguintes elementos:\n“Batata” por “Morango”\n“Tomate” por “Maçã”\n“Cebola” por “Pêssego”\nOrdenar a lista em ordem alfabética.\nExibir a lista modificada no console.\nCriar uma condição para verificar se “maracujá” está na lista de frutas.\nSe a condição for atendida, exibir “Sim, há maracujá” no console; caso contrário, exibir “Não há maracujá”.\nInverter a ordem da lista e exibir a lista modificada no console.",
        "codigo":{"es":"frutas = [\"pistacho\", \"Mandarina\", \"Patata\", \"Naranja\", \"Pomelo\", \"Coco\", \"Tomate\", \"Kiwi\", \"Mango\", \"Cebolla\"]","en":"fruits = [\"pistachio\", \"Tangerine\", \"Potato\", \"Orange\", \"Grapefruit\", \"Coconut\", \"Tomato\", \"Kiwi\", \"Mango\", \"Onion\"]","pt":"frutas = [\"pistache\", \"Tangerina\", \"Batata\", \"Laranja\", \"Toranja\", \"Coco\", \"Tomate\", \"Kiwi\", \"Manga\", \"Cebola\"]"}
    },
    {
        "id": "listas02-01",
        "clase": "PYTH_1300 - C02 - Listas 02",
        "es": "Instrucciones\n\nGestión de puntajes en una lista con Python\nEn este ejercicio, trabajarás con listas en Python para almacenar, agregar y eliminar puntajes, así como realizar validaciones con bucles.\n\nEn tu archivo main:\nCrear una variable con el nombre puntajes con una lista vacía.\nAgregar a la lista los puntajes 1000, 920, 830, 750 y 670 de mayor a menor utilizando el método correspondiente.\nQuitar de la lista los puntajes 920, 830 y 750 utilizando el método correspondiente.\nCrear una variable llamada contador, con un valor igual a 0 para usar como contador.\nUtilizar un input() con el texto 'Por favor indique la cantidad de puntajes a ingresar' y guardar el valor de su respuesta en una variable llamada cantidadPuntajes.\nCrear un bucle while para verificar que el valor de cantidadPuntajes sea un número.\nEjecute un input() con el texto 'Por favor indique la cantidad de puntajes a ingresar' y guarde el valor de su respuesta en la variable llamada cantidadPuntajes.\nCrear otro bucle while para que se ejecute mientras contador sea menor a cantidadPuntajes.\nDentro del while:\nIncrementar contador en 1.\nCrear una variable puntaje con input() para almacenar el valor ingresado.\nAgregar el puntaje a la lista y convertirlo a int.\nMostrar por consola el texto 'Los mejores puntajes son:'.\nRealizar un print() de la lista.",
        "en": "Instructions\n\nScore management in a list with Python\nIn this exercise, you will work with lists in Python to store, add, and remove scores, as well as perform validations with loops.\n\nIn your main file:\nCreate a variable named scores with an empty list.\nAdd the scores 1000, 920, 830, 750, and 670 to the list from highest to lowest using the appropriate method.\nRemove the scores 920, 830, and 750 from the list using the appropriate method.\nCreate a variable called counter, with a value equal to 0 to use as a counter.\nUse an input() with the text 'Please indicate the number of scores to enter' and store the value of its response in a variable called numberOfScores.\nCreate a while loop to verify that the value of numberOfScores is a number.\nExecute an input() with the text 'Please indicate the number of scores to enter' and store the value of its response in the variable called numberOfScores.\nCreate another while loop that runs while counter is less than numberOfScores.\nInside the while:\nIncrement counter by 1.\nCreate a variable score with input() to store the entered value.\nAdd the score to the list and convert it to int.\nDisplay on the console the text 'The best scores are:'.\nMake a print() of the list.",
        "pt": "Instruções\n\nGestão de pontuações em uma lista com Python\nNeste exercício, você trabalhará com listas em Python para armazenar, adicionar e remover pontuações, bem como realizar validações com loops.\n\nNo seu arquivo principal, você deve:\nCriar uma variável chamada pontuações com uma lista vazia.\nAdicionar à lista as pontuações 1000, 920, 830, 750 e 670 da maior para a menor usando o método apropriado.\nRemover da lista as pontuações 920, 830 e 750 usando o método apropriado.\nCriar uma variável chamada contador, com um valor igual a 0 para usar como contador.\nUsar um input() com o texto 'Por favor, indique a quantidade de pontuações a serem inseridas' e armazenar o valor de sua resposta em uma variável chamada quantidadePontuações.\nCriar um loop while para verificar se o valor de quantidadePontuações é um número.\nExecutar um input() com o texto 'Por favor, indique a quantidade de pontuações a serem inseridas' e armazenar o valor de sua resposta na variável chamada quantidadePontuações.\nCriar outro loop while que execute enquanto o contador for menor que quantidadePontuações.\nDentro do while:\nIncrementar o contador em 1.\nCriar uma variável pontuação com input() para armazenar o valor inserido.\nAdicionar a pontuação à lista e convertê-la em int.\nExibir no console o texto 'As melhores pontuações são:'.\nFazer um print() da lista.",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id": "listas02-02",
        "clase": "PYTH_1300 - C02 - Listas 02",
        "es": "Instrucciones\n\nAnálisis y manipulación de puntajes en una lista\nEn este ejercicio, aprenderás cómo manipular listas en Python al trabajar con puntajes. Utilizarás métodos para obtener el puntaje mínimo, máximo, promedio y ordenarlos en diferentes formas.\n\nEn tu archivo main deberás:\nObtener el puntaje mínimo de la lista, almacenarlo en una variable llamada minimo y luego mostrar su valor por consola.\nObtener el puntaje máximo de la lista, almacenarlo en una variable llamada maximo y luego mostrar su valor por consola.\nObtener el puntaje promedio de la lista, almacenarlo en una variable llamada promedio y luego mostrar su valor por consola.\nPara calcular el promedio, deberás utilizar los métodos sum() y len() sobre la lista de puntajes para obtener los valores necesarios para la operación matemática.\nInvertir el orden de los puntajes de la lista usando el método necesario y realizar un print() de la lista.\nOrdenar los puntajes de la lista de menor a mayor usando el método necesario para hacerlo de forma automática.\nMostrar por consola el texto 'El TOP SCORE final es: ' y debajo realizar un print() de la lista.",
        "en": "Instructions\n\nAnalysis and manipulation of scores in a list\nIn this exercise, you will learn how to manipulate lists in Python by working with scores. You will use methods to obtain the minimum score, maximum score, average score, and sort them in different ways.\n\nIn your main file you must:\nObtain the minimum score from the list, store it in a variable called minimum, and then display its value on the console.\nObtain the maximum score from the list, store it in a variable called maximum, and then display its value on the console.\nObtain the average score from the list, store it in a variable called average, and then display its value on the console.\nTo calculate the average, you should use the sum() and len() methods on the score list to obtain the values necessary for the mathematical operation.\nReverse the order of the scores in the list using the necessary method and make a print() of the list.\nSort the scores in the list from lowest to highest using the necessary method to do it automatically.\nDisplay on the console the text 'The final TOP SCORE is: ' and below make a print() of the list.",
        "pt": "Instruções\n\nAnálise e manipulação de pontuações em uma lista\nNeste exercício, você aprenderá como manipular listas em Python trabalhando com pontuações. Você usará métodos para obter a pontuação mínima, máxima, média e ordená-las de diferentes maneiras.\n\nNo seu arquivo principal, você deve:\nObter a pontuação mínima da lista, armazená-la em uma variável chamada mínimo e depois exibir seu valor no console.\nObter a pontuação máxima da lista, armazená-la em uma variável chamada máximo e depois exibir seu valor no console.\nObter a pontuação média da lista, armazená-la em uma variável chamada média e depois exibir seu valor no console.\nPara calcular a média, você deve usar os métodos sum() e len() na lista de pontuações para obter os valores necessários para a operação matemática.\nInverter a ordem das pontuações na lista usando o método necessário e fazer um print() da lista.\nOrdenar as pontuações na lista do menor para o maior usando o método necessário para fazê-lo automaticamente.\nExibir no console o texto 'A PONTUAÇÃO MÁXIMA final é: ' e abaixo fazer um print() da lista.",
        "codigo":{"es":"# Lista de puntajes inicial \npuntajes = [850, 920, 670, 750, 830, 1000]","en":"# Initial score list \nscores = [850, 920, 670, 750, 830, 1000]","pt":"# Lista inicial de pontuações \npontuações = [850, 920, 670, 750, 830, 1000]"}
    },
    {
        "id": "forIn-01",
        "clase":"PYTH_1300 - C03 - Bucles for...in",
        "es":"Instrucciones\n\nRecorriendo palabras\nEn este ejercicio, practicarás el uso de bucles en Python para recorrer cadenas de texto. Aprenderás a utilizar el bucle for para trabajar con cada carácter de una palabra ingresada por el usuario.\n\nEn tu archivo main, deberás:\nSolicitar una palabra al usuario:\nPide al usuario que ingrese una palabra y almacénala en una variable llamada palabra.\nMuestra un mensaje informativo como 'Las letras de la palabra son:'\nRecorrer y mostrar cada carácter de la palabra:\nUtiliza un bucle for para recorrer cada letra de la palabra, utilizando como iterador la variable letra.\nImprime cada letra en una nueva línea usando la función print().",
        "en":"Instructions\n\nTraversing words\nIn this exercise, you will practice using loops in Python to traverse strings. You will learn to use the for loop to work with each character of a word entered by the user.\n\nIn your main file, you must:\nRequest a word from the user:\nAsk the user to enter a word and store it in a variable called word.\nDisplay an informative message like 'The letters of the word are:'\nTraverse and display each character of the word:\nUse a for loop to traverse each letter of the word, using the variable letter as an iterator.\nPrint each letter on a new line using the print() function.",
        "pt":"Instruções\n\nPercorrendo palavras\nNeste exercício, você praticará o uso de loops em Python para percorrer strings. Você aprenderá a usar o loop for para trabalhar com cada caractere de uma palavra inserida pelo usuário.\n\nNo seu arquivo principal, você deve:\nSolicitar uma palavra ao usuário:\nPeça ao usuário que insira uma palavra e armazene-a em uma variável chamada palavra.\nExiba uma mensagem informativa como 'As letras da palavra são:'\nPercorrer e exibir cada caractere da palavra:\nUse um loop for para percorrer cada letra da palavra, usando a variável letra como iterador.\nImprima cada letra em uma nova linha usando a função print().",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id": "diccionario-01-01",
        "clase":"PYTH_1400 - C01 - Diccionarios",
        "es":"Instrucciones\n\nManejo de diccionarios para describir autos\nEn este ejercicio, aprenderás a crear diccionarios para almacenar datos relacionados con objetos, como en este caso, autos.\n\nEn tu archivo main deberás:\nCrear una variable llamada auto1 y, dentro de ella, guardar un diccionario con al menos tres propiedades (color, cantidad_puertas, marca).\nRepetir el paso anterior, pero replicando la estructura de datos para las variables auto2, auto3 y auto4.\nA través de la notación de corchetes, modificar el color del auto2 y luego mostrarlo por consola.",
        "en":"Instructions\n\nHandling dictionaries to describe cars\nIn this exercise, you will learn to create dictionaries to store data related to objects, such as cars in this case.\n\nIn your main file you must:\nCreate a variable called car1 and, within it, store a dictionary with at least three properties (color, number_of_doors, brand).\nRepeat the previous step, but replicating the data structure for the variables car2, car3, and car4.\nUsing bracket notation, modify the color of car2 and then display it on the console.",
        "pt":"Instruções\n\nManipulação de dicionários para descrever carros\nNeste exercício, você aprenderá a criar dicionários para armazenar dados relacionados a objetos, como carros neste caso.\n\nNo seu arquivo principal, você deve:\nCriar uma variável chamada carro1 e, dentro dela, armazenar um dicionário com pelo menos três propriedades (cor, quantidade_portas, marca).\nRepetir o passo anterior, mas replicando a estrutura de dados para as variáveis carro2, carro3 e carro4.\nUsando a notação de colchetes, modificar a cor do carro2 e depois exibi-lo no console.",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id": "diccionario-01-03",
        "clase":"PYTH_1400 - C01 - Diccionarios",
        "es":"Instrucciones\n\nCreación y modificación de diccionarios con múltiples propiedades\nEn este ejercicio, aprenderás a trabajar con diccionarios en Python, agregando propiedades y valores dinámicamente.\n\nEn tu archivo main deberás:\nCrear una variable llamada superheroe y, dentro de ella, guardar un diccionario vacío, sin propiedades.\nAgregar seis propiedades (nombre, identidadSecreta, edad, ciudad, enemigos, poderes), pero sin modificar la sintaxis del punto anterior, es decir, utilizando la siguiente funcionalidad: variable[“clave”] = valor.\nEl superhéroe debe tener más de un poder, pero que estén todos registrados en una sola clave del diccionario llamada “poderes”.\nLuego, muestra en un print() el diccionario.",
        "en":"Instructions\n\nCreation and modification of dictionaries with multiple properties\nIn this exercise, you will learn to work with dictionaries in Python, adding properties and values dynamically.\n\nIn your main file you must:\nCreate a variable called superhero and, within it, store an empty dictionary, without properties.\nAdd six properties (name, secretIdentity, age, city, enemies, powers), but without modifying the syntax of the previous point, that is, using the following functionality: variable[“key”] = value.\nThe superhero must have more than one power, but they should all be recorded in a single key of the dictionary called “powers”.\nThen, display the dictionary in a print().",
        "pt":"Instruções\n\nCriação e modificação de dicionários com múltiplas propriedades\nNeste exercício, você aprenderá a trabalhar com dicionários em Python, adicionando propriedades e valores dinamicamente.\n\nNo seu arquivo principal, você deve:\nCriar uma variável chamada super-herói e, dentro dela, armazenar um dicionário vazio, sem propriedades.\nAdicionar seis propriedades (nome, identidadeSecreta, idade, cidade, inimigos, poderes), mas sem modificar a sintaxe do ponto anterior, ou seja, usando a seguinte funcionalidade: variável[“chave”] = valor.\nO super-herói deve ter mais de um poder, mas todos devem estar registrados em uma única chave do dicionário chamada “poderes”.\nEm seguida, exiba o dicionário em um print().",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id": "diccionario-01-04",
        "clase":"PYTH_1400 - C01 - Diccionarios",
        "es":"Instrucciones\n\nCreación de diccionarios para representar películas\nEn este ejercicio, aprenderás a crear diccionarios que representen películas. Cada diccionario contendrá información clave como el título, protagonista, género y duración.\n\nEn tu archivo main deberás:\nElegir tus seis películas preferidas para crear diccionarios a partir de cada una.\nDeberás crear una variable llamada pelicula1 y, dentro de ella, guardar un diccionario con al menos cuatro propiedades: título, protagonista, género y duración (prestar mucha atención a los signos de acentuación de las claves).\nRepetir el paso anterior, pero replicando la estructura de datos para las variables pelicula2, pelicula3, pelicula4, pelicula5 y pelicula6. Además, deberás tener dos películas de cada género: comedia, drama y acción.\nUna vez creados los seis diccionarios de películas, mostrar las películas creadas por consola, una por una.",
        "en":"Instructions\n\nCreation of dictionaries to represent movies\nIn this exercise, you will learn to create dictionaries that represent movies. Each dictionary will contain key information such as title, protagonist, genre, and duration.\n\nIn your main file you must:\nChoose your six favorite movies to create dictionaries from each one.\nYou must create a variable called movie1 and, within it, store a dictionary with at least four properties: title, protagonist, genre, and duration (pay close attention to the accent marks of the keys).\nRepeat the previous step, but replicating the data structure for the variables movie2, movie3, movie4, movie5, and movie6. Additionally, you should have two movies of each genre: comedy, drama, and action.\nOnce the six movie dictionaries are created, display the created movies on the console, one by one.",
        "pt":"Instruções\n\nCriação de dicionários para representar filmes\nNeste exercício, você aprenderá a criar dicionários que representam filmes. Cada dicionário conterá informações-chave como título, protagonista, gênero e duração.\n\nNo seu arquivo principal, você deve:\nEscolher seus seis filmes favoritos para criar dicionários a partir de cada um.\nVocê deve criar uma variável chamada filme1 e, dentro dela, armazenar um dicionário com pelo menos quatro propriedades: título, protagonista, gênero e duração (preste muita atenção aos sinais de acentuação das chaves).\nRepetir o passo anterior, mas replicando a estrutura de dados para as variáveis filme2, filme3, filme4, filme5 e filme6. Além disso, você deve ter dois filmes de cada gênero: comédia, drama e ação.\nUma vez criados os seis dicionários de filmes, exiba os filmes criados no console, um por um.",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id":"diccionario-02-01",
        "clase":"PYTH_1400 - C02 - Listas de Diccionarios",
        "es":"Instrucciones\n\nRegistro y almacenamiento de jugadores\nEste ejercicio consiste en crear una lista vacía llamada jugadores y utilizar un bucle while para solicitar información sobre tres jugadores, como su nombre, apellido, edad, y los clubes a los que pertenecen. Esta información se guardará en un diccionario, y luego se agregará a la lista jugadores.\n\nEn tu archivo main deberás:\nCrear una variable llamada jugadores que contenga una lista vacía.\nCrear una variable llamada contador que contenga el número 1.\nUtilizar un bucle while que se repita siempre que contador sea menor o igual a 3 y que dentro de este:\nSolicitar al usuario mediante el uso de input() que se ingrese el nombre, apellido, edad, club1 y club2, y almacenar dichos resultados en 5 variables que posean los respectivos nombres.\nDeberás modificar cada mensaje de input() para concatenar la variable contador al mensaje y generar un resultado dinámico. Ejemplo: nombre = input('Ingrese el nombre del jugador ____')\nLuego de generar las 5 variables, se deberá almacenar la información solicitada en un diccionario llamado jugador. Ejemplo: deportes = {'nombre' : ___}\nAgregar el diccionario a la lista jugadores, utilizando el método necesario.\nIncrementar el valor de la variable contador en uno\nMediante el uso de un bucle for, recorrer la lista jugadores y mostrar los datos de cada uno.\nCrear una variable llamada indice con valor inicial 1 e incrementarla dentro del bucle.\nImportante: Usar jugador como nombre de la variable del bucle for (no usar i ni otros nombres genéricos).\nUtilizar print() con concatenación (+) para mostrar la información de cada jugador en una sola línea de código, con el siguiente formato:\n'Los datos del jugador 1 son: Nombre Apellido, Edad: __, Clubes: Club1 y Club2'",
        "en":"Instructions\n\nRegistration and storage of players\nThis exercise consists of creating an empty list called players and using a while loop to request information about three players, such as their first name, last name, age, and the clubs they belong to. This information will be stored in a dictionary, and then added to the players list.\n\nIn your main file you must:\nCreate a variable called players that contains an empty list.\nCreate a variable called counter that contains the number 1.\nUse a while loop that repeats as long as counter is less than or equal to 3 and within it:\nRequest the user through the use of input() to enter the first name, last name, age, club1, and club2, and store these results in 5 variables with the respective names.\nYou should modify each input() message to concatenate the counter variable to the message and generate a dynamic result. Example: name = input('Enter the name of player ____')\nAfter generating the 5 variables, you should store the requested information in a dictionary called player. Example: sports = {'name' : ___}\nAdd the dictionary to the players list, using the necessary method.\nIncrement the value of the counter variable by one\nUsing a for loop, traverse the players list and display the data of each one.\nCreate a variable called index with an initial value of 1 and increment it within the loop.\nImportant: Use player as the name of the for loop variable (do not use i or other generic names).\nUse print() with concatenation (+) to display each player's information in a single line of code, with the following format:\n'The data of player 1 are: First Name Last Name, Age: __, Clubs: Club1 and Club2'",
        "pt":"Instruções\n\nRegistro e armazenamento de jogadores\nEste exercício consiste em criar uma lista vazia chamada jogadores e usar um loop while para solicitar informações sobre três jogadores, como nome, sobrenome, idade e os clubes aos quais pertencem. Essas informações serão armazenadas em um dicionário e, em seguida, adicionadas à lista jogadores.\n\nNo seu arquivo principal, você deve:\nCriar uma variável chamada jogadores que contenha uma lista vazia.\nCriar uma variável chamada contador que contenha o número 1.\nUsar um loop while que se repita enquanto o contador for menor ou igual a 3 e dentro dele:\nSolicitar ao usuário, por meio do uso de input(), que insira o nome, sobrenome, idade, clube1 e clube2, e armazenar esses resultados em 5 variáveis com os respectivos nomes.\nVocê deve modificar cada mensagem de input() para concatenar a variável contador à mensagem e gerar um resultado dinâmico. Exemplo: nome = input('Insira o nome do jogador ____')\nApós gerar as 5 variáveis, você deve armazenar as informações solicitadas em um dicionário chamado jogador. Exemplo: esportes = {'nome' : ___}\nAdicionar o dicionário à lista jogadores, usando o método necessário.\nIncrementar o valor da variável contador em um\nUsando um loop for, percorrer a lista jogadores e exibir os dados de cada um.\nCriar uma variável chamada índice com valor inicial 1 e incrementá-la dentro do loop.\nImportante: Use jogador como nome da variável do loop for (não use i ou outros nomes genéricos).\nUse print() com concatenação (+) para exibir as informações de cada jogador em uma única linha de código, com o seguinte formato:\n'Os dados do jogador 1 são: Nome Sobrenome, Idade: __, Clubes: Clube1 e Clube2'",
        "codigo":{"es":"", "en":"", "pt":""}
    },
    {
        "id":"diccionario-02-02",
        "clase":"PYTH_1400 - C02 - Listas de Diccionarios",
        "es":"Instrucciones\n\nMostrar biografía de artistas\nEste ejercicio consiste en utilizar un bucle for para iterar sobre una lista de diccionarios, donde cada diccionario contiene información sobre un artista.\n\nEn tu archivo main, debajo del código brindado, deberás:\nCrear un bucle for para iterar la lista de diccionarios (artistas) utilizando como iterador la clave artista.\nDentro del bucle for muestra por consola la biografía de cada artista, concatenando toda la información disponible y respetando el siguiente formato:\nNicole Denise Cucco, (mejor conocida como Nicki Nicole), es una cantante, rapera y compositora de 22 años que nació en Argentina. Sus géneros musicales son el pop, el trap y el hip hop.",
        "en":"Instructions\n\nDisplay artist biography\nThis exercise consists of using a for loop to iterate over a list of dictionaries, where each dictionary contains information about an artist.\n\nIn your main file, below the provided code, you must:\nCreate a for loop to iterate the list of dictionaries (artists) using the key artist as an iterator.\nInside the for loop, display the biography of each artist on the console, concatenating all available information and respecting the following format:\nNicole Denise Cucco, (better known as Nicki Nicole), is a 22-year-old singer, rapper, and songwriter who was born in Argentina. Her musical genres are pop, trap, and hip hop.",
        "pt":"Instruções\n\nExibir biografia de artistas\nEste exercício consiste em usar um loop for para iterar sobre uma lista de dicionários, onde cada dicionário contém informações sobre um artista.\n\nNo seu arquivo principal, abaixo do código fornecido, você deve:\nCriar um loop for para iterar a lista de dicionários (artistas) usando a chave artista como iterador.\nDentro do loop for, exibir a biografia de cada artista no console, concatenando todas as informações disponíveis e respeitando o seguinte formato:\nNicole Denise Cucco, (mais conhecida como Nicki Nicole), é uma cantora, rapper e compositora de 22 anos que nasceu na Argentina. Seus gêneros musicais são pop, trap e hip hop.",
        "codigo":{"es":"artistas = [\n {\n  \"nombreArtistico\": \"Lali\",\n  \"carrera\": [\"actriz\", \"cantante\", \"compositora\"],\n  \"nombre\": \"Mariana Espósito\",\n  \"edad\": 31,\n  \"pais\": \"Argentina\",\n  \"generoMusical\": [\"Pop\", \"Hip hop\", \"Dance pop\"]\n },\n {\n  \"nombreArtistico\": \"Taylor Swift\",\n  \"carrera\": [\"cantante\", \"compositora\", \"productora\"],\n  \"nombre\": \"Taylor Alison Swift\",\n  \"edad\": 33,\n  \"pais\": \"Estados Unidos\",\n  \"generoMusical\": [\"Pop\", \"Country pop\", \"Folk\"]\n },\n {\n   \"nombreArtistico\": \"Karol G\",\n   \"carrera\": [\"cantante\", \"compositora\", \"productora\"],\n   \"nombre\": \"Carolina Giraldo Navarro\",\n   \"edad\": 33,\n   \"pais\": \"Colombia\",\n   \"generoMusical\": [\"Reguetón\", \"Pop urbano\", \"Trap latino\"]\n }\n]","en":"artists = [\n {\n  \"stageName\": \"Lali\",\n  \"career\": [\"actress\", \"singer\", \"songwriter\"],\n  \"name\": \"Mariana Espósito\",\n  \"age\": 31,\n  \"country\": \"Argentina\",\n  \"musicalGenre\": [\"Pop\", \"Hip hop\", \"Dance pop\"]\n },\n {\n  \"stageName\": \"Taylor Swift\",\n  \"career\": [\"singer\", \"songwriter\", \"producer\"],\n  \"name\": \"Taylor Alison Swift\",\n  \"age\": 33,\n  \"country\": \"United States\",\n  \"musicalGenre\": [\"Pop\", \"Country pop\", \"Folk\"]\n },\n {\n   \"stageName\": \"Karol G\",\n   \"career\": [\"singer\", \"songwriter\", \"producer\"],\n   \"name\": \"Carolina Giraldo Navarro\",\n   \"age\": 33,\n   \"country\": \"Colombia\",\n   \"musicalGenre\": [\"Reggaeton\", \"Urban pop\", \"Latin trap\"]\n }\n]","pt":"artistas = [\n {\n  \"nomeArtístico\": \"Lali\",\n  \"carreira\": [\"atriz\", \"cantora\", \"compositora\"],\n  \"nome\": \"Mariana Espósito\",\n  \"idade\": 31,\n  \"país\": \"Argentina\",\n  \"gêneroMusical\": [\"Pop\", \"Hip hop\", \"Dance pop\"]\n },\n {\n  \"nomeArtístico\": \"Taylor Swift\",\n  \"carreira\": [\"cantora\", „compositora“, „produtora“],\n  „nome“: „Taylor Alison Swift“,\n  „idade“: 33,\n  „país“: „Estados Unidos“,\n  „gêneroMusical“: [„Pop“, „Country pop“, „Folk“]\n },\n {\n   „nomeArtístico“: „Karol G“,\n   „carreira“: [„cantora“, „compositora“, „produtora“],\n   „nome“: „Carolina Giraldo Navarro“,\n   „idade“: 33,\n   „país“: „Colômbia“,\n   „gêneroMusical“: [„Reguetón“, „Pop urbano“, „Trap latino“]\n }\n]"}

    }



    
]